Revit 2027 API
PDFExportOptions.PaperFormat Property
 Paper format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPaperFormat PaperFormat { get; set; }
Public Property PaperFormat As ExportPaperFormat
	Get
	Set
public:
property ExportPaperFormat PaperFormat {
	ExportPaperFormat get ();
	void set (ExportPaperFormat value);
}
member PaperFormat : ExportPaperFormat with get, set
Property Value
ExportPaperFormat
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The input paper format is invalid
Remarks
 When the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace